const productsData = [
    // --- قسم قطونيل ---
    {
        "id": 1,
        "name": "حماله دربى",
        "price": "120 - 122 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/حماله دربى/حماله دربى ابيض.webp", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 1.jpg", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 2.webp", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 3.webp", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 4.webp", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 5.webp", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 6.webp", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 7.jpg", "img/proudct/قطونيل/حماله دربى/حماله دربى الوان 7.webp"]
    },
    {
        "id": 2,
        "name": "حمالة ستريتش رجالي",
        "price": "155 - 165 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL", "6XL", "8XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/حمالة ستريتش رجالي/حمالة ستريتش رجالي ابيض.webp", "img/proudct/قطونيل/حمالة ستريتش رجالي/حمالة ستريتش رجالي الوان 1.webp", "img/proudct/قطونيل/حمالة ستريتش رجالي/حمالة ستريتش رجالي الوان 2.webp", "img/proudct/قطونيل/حمالة ستريتش رجالي/حمالة ستريتش رجالي الوان 3.jpg"]
    },
    {
        "id": 3,
        "name": "كت ستريتش رجالي",
        "price": "160 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/كت ستريتش رجالي/كت ستريتش رجالي  ابيض.webp", "img/proudct/قطونيل/كت ستريتش رجالي/كت ستريتش رجالي الوان 1.webp", "img/proudct/قطونيل/كت ستريتش رجالي/كت ستريتش رجالي الوان 2.webp"]
    },
    {
        "id": 4, 
        "name": "نصف كم ستريتش رجالي",
        "price": "195 - 199 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/نصف كم ستريتش رجالي/نصف كم ستريتش رجالي ابيض.webp", "img/proudct/قطونيل/نصف كم ستريتش رجالي/نصف كم ستريتش رجالي الوان 2.webp", "img/proudct/قطونيل/نصف كم ستريتش رجالي/نصف كم ستريتش رجالي الوان 3.webp", "img/proudct/قطونيل/نصف كم ستريتش رجالي/نصف كم ستريتش رجالي الوان.webp"]
    },
    { "id": 6, "name": "نصف كم دربي رجالي", "price": "140 جنيه", "colors": ["ألوان"], "sizes": ["XL"], "category": "قطونيل", "images": [] },
    {
        "id": 7,
        "name": "كم طويل ستريتش رجالي",
        "price": "250 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/كم طويل ستريتش رجالي/كم طويل ستريتش رجالي ابيض.webp", "img/proudct/قطونيل/كم طويل ستريتش رجالي/كم طويل ستريتش رجالي الوان 1.webp", "img/proudct/قطونيل/كم طويل ستريتش رجالي/كم طويل ستريتش رجالي الوان.webp"]
    },
    {
        "id": 8,
        "name": "حمالة سبور رجالي",
        "price": "110 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL", "5XL", "6XL", "7XL", "8XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/حمالة سبور أبيض رجالي/حمالة سبور أبيض رجالي 1.webp", "img/proudct/قطونيل/حمالة سبور أبيض رجالي/حمالة سبور أبيض رجالي.webp"]
    },
    {
        "id": 9,
        "name": "كلسون ستريتش ريلاكس رجالي",
        "price": "250 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/كلسون ستريتش ريلاكس رجالي/كلسون ستريتش ريلاكس رجالي ابيض.webp", "img/proudct/قطونيل/كلسون ستريتش ريلاكس رجالي/كلسون ستريتش ريلاكس رجالي الوان 1.webp", "img/proudct/قطونيل/كلسون ستريتش ريلاكس رجالي/كلسون ستريتش ريلاكس رجالي الوان 2.webp", "img/proudct/قطونيل/كلسون ستريتش ريلاكس رجالي/كلسون ستريتش ريلاكس رجالي الوان.webp"]
    },
    {
        "id": 10,
        "name": "طقم ريلاكس بوكسر + حماله",
        "price": "255 - 257 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 1.webp", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 10.webp", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 2.webp", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 3.webp", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 4.webp", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 5.webp", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 6.webp", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 7.jpg", "img/proudct/قطونيل/طقم ريلاكس بوكسر + حماله/طقم ريلاكس بوكسر + حماله 9.webp"]
    },
    { "id": 11, "name": "بشكير قطونيل صغير 70*140", "price": "330 جنيه", "colors": ["متعدد"], "sizes": ["70*140 CM"], "category": "قطونيل", "images": ["img/proudct/قطونيل/بشكير قطونيل صغير (70x140)/بشكير قطونيل صغير (70x140).jpg"] },
    { "id": 12, "name": "بشكير قطونيل كبير 90*160", "price": "540 جنيه", "colors": ["متعدد"], "sizes": ["90*160 CM"], "category": "قطونيل", "images": ["img/proudct/قطونيل/بشكير قطونيل كبير ( 90x160 )/بشكير قطونيل كبير ( 90x160 ).webp"] },
    { "id": 13, "name": "بكيني ديجيتال رجالي", "price": "80 جنيه", "colors": ["متعدد"], "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"], "category": "قطونيل", "images": ["img/proudct/قطونيل/بيكيني ديجيتال رجالي/بيكيني ديجيتال رجالي.jpg"] },
    {
        "id": 14,
        "name": "بيكيني ريلاكس رجالي",
        "price": "102 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/بيكيني ريلاكس رجالي/بيكيني ريلاكس رجالي 1.webp", "img/proudct/قطونيل/بيكيني ريلاكس رجالي/بيكيني ريلاكس رجالي 2.webp", "img/proudct/قطونيل/بيكيني ريلاكس رجالي/بيكيني ريلاكس رجالي 3.jpg", "img/proudct/قطونيل/بيكيني ريلاكس رجالي/بيكيني ريلاكس رجالي 4.webp", "img/proudct/قطونيل/بيكيني ريلاكس رجالي/بيكيني ريلاكس رجالي.jpg"]
    },
    { "id": 15, "name": "بيكيني ديزاين رجالي", "price": "110 جنيه", "colors": ["متعدد"], "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"], "category": "قطونيل", "images": [] },
    {
        "id": 16,
        "name": "بوكسر Pro رجالي",
        "price": "140 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/بوكسر Pro رجالي/بوكسر Pro رجالي 1.webp", "img/proudct/قطونيل/بوكسر Pro رجالي/بوكسر Pro رجالي 2.avif", "img/proudct/قطونيل/بوكسر Pro رجالي/بوكسر Pro رجالي 3.jpg", "img/proudct/قطونيل/بوكسر Pro رجالي/بوكسر Pro رجالي 4.jpg", "img/proudct/قطونيل/بوكسر Pro رجالي/بوكسر Pro رجالي.jpg"]
    },
    {
        "id": 17,
        "name": "بوكسر ديجيتال رجالي",
        "price": "105 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/بوكسر ديجيتال رجالي/بوكسر ديجيتال رجالي 1.webp", "img/proudct/قطونيل/بوكسر ديجيتال رجالي/بوكسر ديجيتال رجالي 2.jpg", "img/proudct/قطونيل/بوكسر ديجيتال رجالي/بوكسر ديجيتال رجالي 3.webp", "img/proudct/قطونيل/بوكسر ديجيتال رجالي/بوكسر ديجيتال رجالي 4.webp", "img/proudct/قطونيل/بوكسر ديجيتال رجالي/بوكسر ديجيتال رجالي 5.jpg", "img/proudct/قطونيل/بوكسر ديجيتال رجالي/بوكسر ديجيتال رجالي 6.jpg", "img/proudct/قطونيل/بوكسر ديجيتال رجالي/بوكسر ديجيتال رجالي7.jpg"]
    },
    {
        "id": 18,
        "name": "بوكسر ديزاين رجالي",
        "price": "140 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL", "5XL", "6XL", "7XL", "8XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/بوكسر ديزاين رجالي/بوكسر ديزاين رجالي  1.webp", "img/proudct/قطونيل/بوكسر ديزاين رجالي/بوكسر ديزاين رجالي  4.jpeg", "img/proudct/قطونيل/بوكسر ديزاين رجالي/بوكسر ديزاين رجالي 2.jpg", "img/proudct/قطونيل/بوكسر ديزاين رجالي/بوكسر ديزاين رجالي 3.jpg"]
    },
    {
        "id": 19,
        "name": "بوكسر مطبوع رجالي",
        "price": "99 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/بوكسر مطبوع رجالي/بوكسر مطبوع رجالي1.jpg", "img/proudct/قطونيل/بوكسر مطبوع رجالي/بوكسر مطبوع رجالي2.webp", "img/proudct/قطونيل/بوكسر مطبوع رجالي/بوكسر مطبوع رجالي3.jpg", "img/proudct/قطونيل/بوكسر مطبوع رجالي/بوكسر مطبوع رجالي4.webp", "img/proudct/قطونيل/بوكسر مطبوع رجالي/بوكسر مطبوع رجالي5.avif"]
    },
    {
        "id": 20,
        "name": "بوكسر كلاسيك قماش رجالي",
        "price": "165 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/بوكسر كلاسيك قماش رجالي/بوكسر كلاسيك قماش رجالي.jpg", "img/proudct/قطونيل/بوكسر كلاسيك قماش رجالي/بوكسر كلاسيك قماش رجالي1.jpg", "img/proudct/قطونيل/بوكسر كلاسيك قماش رجالي/بوكسر كلاسيك قماش رجالي2.jpg", "img/proudct/قطونيل/بوكسر كلاسيك قماش رجالي/بوكسer كلاسيك قماش رجالي3.jpg", "img/proudct/قطونيل/بوكسer كلاسيك قماش رجالي/بوكسر كلاسيك قماش رجالي4.jpg", "img/proudct/قطونيل/بوكسer كلاسيك قماش رجالي/بوكسر كلاسيك قماش رجالي5.jpg"]
    },
    {
        "id": 21,
        "name": "بوكسر ريلاكس رجالي",
        "price": "115 جنيه",
        "colors": ["متعدد"],
        "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL", "5XL", "6XL", "7XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي1.jpg", "img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي2.jpg", "img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي3.jpg", "img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي4.webp", "img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي5.jpg", "img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي6.webp", "img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي7.webp", "img/proudct/قطونيل/بوكسر ريلاكس رجالي/بوكسر ريلاكس رجالي8.webp"]
    },
    { "id": 22, "name": "سليب رجالي", "price": "110 جنيه", "colors": ["أبيض"], "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL"], "category": "قطونيل", "images": ["img/proudct/قطونيل/سليب رجالي أبيض/سليب رجالي أبيض 1.webp", "img/proudct/قطونيل/سليب رجالي أبيض/سليب رجالي أبيض 2.jpg"] },
    { "id": 23, "name": "شورت رجالي", "price": "130 جنيه", "colors": ["أبيض"], "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL", "5XL", "6XL"], "category": "قطونيل", "images": ["img/proudct/قطونيل/شورت أبيض رجالي/شورت أبيض رجالي 1.webp", "img/proudct/قطونيل/شورت أبيض رجالي/شورت أبيض رجالي 2.webp", "img/proudct/قطونيل/شورت أبيض رجالي/شورت أبيض رجالي 3.webp"] },
    {
        "id": 24,
        "name": "طقم دفاية انترلوك رجالي",
        "price": "550 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/طقم دفاية انترلوك رجالي/طقم دفاية انترلوك رجالي.webp", "img/proudct/قطونيل/طقم دفاية انترلوك رجالي/طقم دفاية انترلوك رجالي1.webp", "img/proudct/قطونيل/طقم دفاية انترلوك رجالي/طقم دفاية انترلوك رجالي2.webp"]
    },
    {
        "id": 25,
        "name": "فانيله بكم طويل رجالي",
        "price": "250 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/فانيله بكم طويل (انترلوك) رجالي/فانيله بكم طويل (انترلوك) رجالي.jpg", "img/proudct/قطونيل/فانيله بكم طويل (انترلوك) رجالي/فانيله بكم طويل (انترلوك) رجالي1.jpg"]
    },
    {
        "id": 26,
        "name": "كالسون رجالي",
        "price": "250 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل",
        "images": ["img/proudct/قطونيل/كالسون (انترلوك) رجالي/كالسون (انترلوك) رجالي 2.jpg", "img/proudct/قطونيل/كالسون (انترلوك) رجالي/كالسون (انترلوك) رجالي.jpg"]
    },
    { "id": 27, "name": "فوطه صغيرة 50*100", "price": "180 جنيه", "colors": ["متعدد"], "sizes": ["50*100 CM"], "category": "قطونيل", "images": [] },
    { "id": 28, "name": "نص كم ممشط رجالي", "price": "130 - 145 جنيه", "colors": ["أبيض", "ألوان"], "sizes": ["S", "M", "L", "XL", "2XL", "3XL", "4XL", "5XL", "6XL", "7XL"], "category": "قطونيل", "images": [] },

    // --- قسم قطونيل أطفال ---
    {
        "id": 29,
        "name": "نص كم ايزي توب بناتي",
        "price": "133 جنيه",
        "colors": ["متعدد"],
        "sizes": ["3-4", "5-6", "7-8", "9-10", "11-12", "13-14", "15-16"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/نص كم ايزي توب بناتي/نص كم ايزي توب بناتي 1.webp", "img/proudct/قطونيل اطفال/نص كم ايزي توب بناتي/نص كم ايزي توب بناتي 2.webp", "img/proudct/قطونيل اطفال/نص كم ايزي توب بناتي/نص كم ايزي توب بناتي 3.jpg", "img/proudct/قطونيل اطفال/نص كم ايزي توب بناتي/نص كم ايزي توب بناتي 4.jpg"]
    },
    { "id": 30, "name": "بدي كم هاي نك بناتي", "price": "133 جنيه", "colors": ["متعدد"], "sizes": ["3-4", "5-6", "7-8", "9-10", "11-12", "13-14", "15-16"], "category": "قطونيل اطفال", "images": [] },
    { "id": 31, "name": "بدي كم ستريتش بناتي", "price": "152 جنيه", "colors": ["متعدد"], "sizes": ["7-8", "9-10", "11-12", "13-14", "15-16"], "category": "قطونيل اطفال", "images": [] },
    {
        "id": 32,
        "name": "بوكسر تيربو اولادي",
        "price": "96 جنيه",
        "colors": ["متعدد"],
        "sizes": ["1-2", "3-4", "5-6", "7-8", "9-10", "11-12", "13-14", "15-16"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي.jpg", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي1.jpg", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي2.jpg", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي3.jpg", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي4.jpg", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي5.jpg", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي6.jpg", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي7.webp", "img/proudct/قطونيل اطفال/بوكسر تيربو اولادي/بوكسر تيربو اولادي8.webp"]
    },
    { "id": 33, "name": "حمالة دربى اولادي", "price": "50 جنيه", "colors": ["أبيض"], "sizes": ["3-4"], "category": "قطونيل اطفال", "images": [] },
    {
        "id": 34,
        "name": "حماله ستريتش اولادي",
        "price": "108 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["3-4", "5-6", "7-8", "9-10", "11-12", "13-14", "15-16"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/حماله ستريتش  اولادي/حماله ستريتش اولادي 1.webp", "img/proudct/قطونيل اطفال/حماله ستريتش  اولادي/حماله ستريتش اولادي 2.jpg", "img/proudct/قطونيل اطفال/حماله ستريتش  اولادي/حماله ستريتش اولادي ابيض.webp", "img/proudct/قطونيل اطفال/حماله ستريتش  اولادي/حماله ستريتش اولادي.webp"]
    },
    { "id": 35, "name": "شورت هارت بناتي", "price": "88 جنيه", "colors": ["متعدد"], "sizes": ["3-4", "5-6", "7-8", "9-10", "11-12", "13-14"], "category": "قطونيل اطفال", "images": [] },
    {
        "id": 36,
        "name": "طقم تيربو اولادي",
        "price": "174 جنيه",
        "colors": ["متعدد"],
        "sizes": ["1-2", "3-4", "5-6", "7-8", "9-10", "11-12", "13-14", "15-16"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/طقم تيربو (بوكسر+حماله) اولادي/طقم تيربو (بوكسر+حماله) اولادي1.jpg", "img/proudct/قطونيل اطفال/طقم تيربو (بوكسر+حماله) اولادي/طقم تيربو (بوكسر+حماله) اولادي2.jpg", "img/proudct/قطونيل اطفال/طقم تيربو (بوكسر+حماله) اولادي/طقم تيربو (بوكسر+حماله) اولادي3.jpg", "img/proudct/قطونيل اطفال/طقم تيربو (بوكسر+حماله) اولادي/طقم تيربو (بوكسر+حماله) اولادي4.webp", "img/proudct/قطونيل اطفال/طقم تيربو (بوكسر+حماله) اولادي/طقم تيربو (بوكسر+حماله) اولادي5.jpg", "img/proudct/قطونيل اطفال/طقم تيربو (بوكسر+حماله) اولادي/طقم تيربو (بوكسر+حماله) اولادي6.webp"]
    },
    {
        "id": 37,
        "name": "طقم كالسون ريلاكس اولادي",
        "price": "318 جنيه",
        "colors": ["متعدد"],
        "sizes": ["1-2", "3-4", "5-6", "7-8", "9-10"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/طقم كالسون ريلاكس اولادي/طقم كالسون ريلاكس اولادي.webp", "img/proudct/قطونيل اطفال/طقم كالسون ريلاكس اولادي/طقم كالسون ريلاكس اولادي1.webp", "img/proudct/قطونيل اطفال/طقم كالسون ريلاكس اولادي/طقم كالسون ريلاكس اولادي2.webp"]
    },
    {
        "id": 38,
        "name": "طقم هارت بناتي",
        "price": "145 جنيه",
        "colors": ["متعدد"],
        "sizes": ["1-2", "3-4", "5-6", "7-8", "9-10", "11-12", "13-14"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/طقم هارت (توب + اندر) بناتي/طقم هارت (توب + اندر) بناتي1.webp", "img/proudct/قطونيل اطفال/طقم هارت (توب + اندر) بناتي/طقم هارت (توب + اندر) بناتي2.jpg", "img/proudct/قطونيل اطفال/طقم هارت (توب + اندر) بناتي/طقم هارت (توب + اندر) بناتي3.webp", "img/proudct/قطونيل اطفال/طقم هارت (توب + اندر) بناتي/طقم هارت (توب + اندر) بناتي4.jpg", "img/proudct/قطونيل اطفال/طقم هارت (توب + اندر) بناتي/طقم هارت (توب + اندر) بناتي5.jpg"]
    },
    { "id": 39, "name": "هوت شورت بناتي", "price": "160 جنيه", "colors": ["متعدد"], "sizes": ["1-2", "3-4", "5-6", "7-8", "9-10", "11-12", "13-14"], "category": "قطونيل اطفال", "images": [] },
    {
        "id": 40,
        "name": "طقم هوت بناتي",
        "price": "155 جنيه",
        "colors": ["متعدد"],
        "sizes": ["1-2", "3-4", "5-6", "7-8", "9-10", "11-12", "13-14"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/طقم هوت (توب + هوت شورت) بناتي/طقم هوت (توب + هوت شورت) بناتي.webp", "img/proudct/قطونيل اطفال/طقم هوت (توب + هوت شورت) بناتي/طقم هوت (توب + هوت شورت) بناتي1.jpg", "img/proudct/قطونيل اطفال/طقم هوت (توب + هوت شورت) بناتي/طقم هوت (توب + هوت شورت) بناتي2.webp", "img/proudct/قطونيل اطفال/طقم هوت (توب + هوت شورت) بناتي/طقم هوت (توب + هوت شورت) بناتي4.webp", "img/proudct/قطونيل اطفال/طقم هوت (توب + هوت شورت) بناتي/طقم هوت (توب + هوت شورت) بناتي5.webp"]
    },
    {
        "id": 41,
        "name": "كم ستريتش اولادي",
        "price": "130 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["1-2", "3-4", "5-6", "7-8", "9-10", "11-12", "13-14", "15-16"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/كم ستريتش اولادي/كم ستريتش اولادي.webp", "img/proudct/قطونيل اطفال/كم ستريتش اولادي/كم ستريتش اولادي1.jpg"]
    },
    {
        "id": 42,
        "name": "اندر كاندي مطبوع بناتي",
        "price": "133 جنيه",
        "colors": ["متعدد"],
        "sizes": ["5-6", "7-8", "9-10", "11-12", "13-14", "15-16"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/اندر كاندي مطبوع (2ق) بناتي/اندر كاندي مطبوع (2ق) بناتي.webp", "img/proudct/قطونيل اطفال/اندر كاندي مطبوع (2ق) بناتي/اندر كاندي مطبوع (2ق) بناتي1.webp"]
    },
    {
        "id": 43,
        "name": "نص كم ستريتش اولادي",
        "price": "140 جنيه",
        "colors": ["أبيض", "ألوان"],
        "sizes": ["3-4", "5-6", "7-8", "9-10", "11-12", "13-14", "15-16"],
        "category": "قطونيل اطفال",
        "images": ["img/proudct/قطونيل اطفال/نص كم ستريتش اولادي/نص كم ستريتش اولادي.webp", "img/proudct/قطونيل اطفال/نص كم ستريتش اولادي/نص كم ستريتش اولادي1.webp"]
    },

    // --- قسم قطونيل حريمي Vega (تم الدمج والتنظيم) ---
    {
        "id": 44,
        "name": "نص كم ايزي توب حريمي",
        "price": "150 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/نص كم ايزي توب حريمي/نص كم ايزي توب حريمي 1.webp", "img/proudct/قطونيل حريمي vega/نص كم ايزي توب حريمي/نص كم ايزي توب حريمي 2.webp", "img/proudct/قطونيل حريمي vega/نص كم ايزي توب حريمي/نص كم ايزي توب حريمي 3.webp", "img/proudct/قطونيل حريمي vega/نص كم ايزي توب حريمي/نص كم ايزي توب حريمي 4.webp", "img/proudct/قطونيل حريمي vega/نص كم ايزي توب حريمي/نص كم ايزي توب حريمي 5.avif"]
    },
    { "id": 47, "name": "بدي فيجا عادي واستك", "price": "75 جنيه", "colors": ["متعدد"], "sizes": ["مقاس واحد"], "category": "قطونيل حريمي vega", "images": [] },
    {
        "id": 48,
        "name": "بنطلون طويل ليجين حريمي",
        "price": "205 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL", "4XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/بنطلون طويل ليجين حريمي/بنطلون طويل ليجين حريمي.jpg"]
    },
    {
        "id": 52,
        "name": "بنطلون فيجا حريمي",
        "price": "295 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": []
    },
    {
        "id": 55,
        "name": "حماله توب قطن حريمي",
        "price": "140 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/حماله توب قطن حريمي/حماله توب قطن حريمي.jpg", "img/proudct/قطونيل حريمي vega/حماله توب قطن حريمي/حماله توب قطن حريمي1.jpg"]
    },
    {
        "id": 58,
        "name": "برا سبورت قطن حريمي",
        "price": "165 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL", "4XL", "5XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/برا سبورت قطن حريمي(701)/برا سبورت قطن حريمي(701) 5.jpg", "img/proudct/قطونيل حريمي vega/برا سبورت قطن حريمي(701)/برا سبورت قطن حريمي(701).avif", "img/proudct/قطونيل حريمي vega/برا سبورت قطن حريمي(701)/برا سبورت قطن حريمي(701)2.webp", "img/proudct/قطونيل حريمي vega/برا سبورت قطن حريمي(701)/برا سبورت قطن حريمي(701)3.jpg", "img/proudct/قطونيل حريمي vega/برا سبورت قطن حريمي(701)/برا سبورت قطن حريمي(701)4.jpg"]
    },
    {
        "id": 64,
        "name": "برا سوفت قطن حريمي",
        "price": "165 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/برا سوفت قطن حريمي/برا سوفت قطن حريمي.jpg"]
    },
    {
        "id": 67,
        "name": "شورت قطن حريمي",
        "price": "192 جنيه",
        "colors": ["ألوان"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/شورت قطن الوان حريمي/شورت قطن الوان حريمي.webp"]
    },
    {
        "id": 70,
        "name": "برا فاير حريمي",
        "price": "140 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": []
    },
    {
        "id": 73,
        "name": "كت توب حريمي",
        "price": "159 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/كت توب (هاي نك) حريمي/كت توب (هاي نك) حريمي.jpg"]
    },
    { "id": 76, "name": "نك اب توب", "price": "115 جنيه", "colors": ["متعدد"], "sizes": ["مقاس واحد"], "category": "قطونيل حريمي vega", "images": [] },
    {
        "id": 77,
        "name": "كم طويل قطن",
        "price": "236 - 250 جنيه",
        "colors": ["متعدد"],
        "sizes": ["M", "L", "XL", "2XL", "3XL"],
        "category": "قطونيل حريمي vega",
        "images": ["img/proudct/قطونيل حريمي vega/كم طويل (نو نك) قطن/كم طويل (نو نك) قطن 6.webp", "img/proudct/قطونيل حريمي vega/كم طويل (نو نك) قطن/كم طويل (نو نك) قطن.webp", "img/proudct/قطونيل حريمي vega/كم طويل (نو نك) قطن/كم طويل (نو نك) قطن1.webp", "img/proudct/قطونيل حريمي vega/كم طويل (نو نك) قطن/كم طويل (نو نك) قطن2.webp", "img/proudct/قطونيل حريمي vega/كم طويل (نو نك) قطن/كم طويل (نو نك) قطن3.webp", "img/proudct/قطونيل حريمي vega/كم طويل (نو نك) قطن/كم طويل (نو نك) قطن5.webp", "img/proudct/قطونيل حريمي vega/كم طويل (هاي نك) قطن/كم طويل (هاي نك) قطن 1.webp", "img/proudct/قطونيل حريمي vega/كم طويل (هاي نك) قطن/كم طويل (هاي نك) قطن.webp"]
    }
];